Repository: adityaehhhh/farmegenie
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: hi, or, pa

source: Agri AI
hi: अग्रि एआई
or: ଅଗ୍ରି୍ AI
pa: ਅਗਰੀ ਏਆਈ

source: Home
hi: होम
or: ଘର
pa: ਘਰ

source: Disease Detection
hi: रोग पहचान
or: ରୋଗ ଶନାକ୍ତକରଣ
pa: ਰੋਗ ਪਛਾਣ

source: Crop Recommendation
hi: फसल सिफारिश
or: ଫସଲ ସୁପାରିଶ
pa: ਫਸਲ ਸਿਫਾਰਸ਼

source: Yield Prediction
hi: उपज पूर्वानुमान
or: ଉତ୍ପାଦନ ପୂର୍ବାନୁମାନ
pa: ਫ਼ਸਲ ਦੀ ਉਪਜ ਭਵਿੱਖਬਾਣੀ

source: Price Recommendation
hi: मूल्य सिफारिश
or: ମୂଲ୍ୟ ସୁପାରିଶ
pa: ਕੀਮਤ ਸਿਫਾਰਸ਼

source: Crop Health
hi: फसल स्वास्थ्य
or: ଫସଲ ସ୍ୱାସ୍ଥ୍ୟ
pa: ਫ਼ਸਲ ਸਿਹਤ

source: Dashboard
hi: डैशबोर्ड
or: ଡ୍ୟାଶବର୍ଡ
pa: ਡੈਸ਼ਬੋਰਡ

source: Language
hi: भाषा
or: ଭାଷା
pa: ਭਾਸ਼ਾ

source: Login
hi: लॉगिन
or: ଲଗ୍ଇନ୍
pa: ਲੌਗਇਨ

source: Register
hi: रजिस्टर
or: ରେଜିଷ୍ଟର୍
pa: ਰਜਿਸਟਰ

source: Logout
hi: लॉगआउट
or: ଲଗ୍ଆଉଟ୍
pa: ਲੌਗਆਊਟ

source: Welcome to Agri AI - Smart Farming Solutions
hi: अग्रि एआई में आपका स्वागत - स्मार्ट फार्मिंग समाधान
or: ଅଗ୍ରି୍ AI କୁ ସ୍ୱାଗତ - ସ୍ମାର୍ଟ୍ କୃଷି ସମାଧାନ
pa: ਅਗਰੀ ਏਆਈ ਵਿੱਚ ਸਵਾਗਤ ਹੈ - ਸਮਾਰਟ ਖੇਤੀਬਾੜੀ ਹੱਲ

source: Empowering farmers with AI-driven insights for sustainable agriculture
hi: कृषकों को सतत कृषि के लिए एआई-चालित अंतर्दृष्टि से सशक्त बनाना
or: ସ୍ଥାୟୀ କୃଷି ପାଇଁ AI-ଚାଳିତ ଆନ୍ତର୍ଦୃଷ୍ଟି ସହିତ କୃଷକଙ୍କୁ ସଶକ୍ତ କରୁଛି
pa: ਸਤਤ ਖੇਤੀਬਾੜੀ ਲਈ ਏਆਈ-ਚਾਲਿਤ ਗਿਆਨ ਨਾਲ ਕਿਸਾਨਾਂ ਨੂੰ ਸਸ਼ਕਤ ਕਰਨਾ

source: Revolutionize Your Farm with AI
hi: एआई के साथ अपनी फार्म को क्रांतिकारी बनाएं
or: AI ସହିତ ଆପଣଙ୍କର କୃଷିକ୍ଷେତ୍ରକୁ କ୍ରାନ୍ତିକାଳୀନ କରନ୍ତୁ
pa: ਏਆਈ ਨਾਲ ਆਪਣੇ ਖੇਤ ਨੂੰ ਕ੍ਰਾਂਤੀਕਾਰੀ ਬਣਾਓ

source: Discover how intelligent tools can optimize yields, detect diseases early, and predict market trends for a prosperous harvest.
hi: जानें कि कैसे बुद्धिमान उपकरण उपज को अनुकूलित कर सकते हैं, रोगों का जल्दी पता लगा सकते हैं, और समृद्ध फसल के लिए बाजार रुझानों की भविष्यवाणी कर सकते हैं।
or: ଜାଣନ୍ତୁ ଯେ କିପରି ବୁଦ୍ଧିମାନ୍ ଉପକରଣଗୁଡ଼ିକ ଉତ୍ପାଦନକୁ ଅନୁକୂଲ କରିପାରେ, ରୋଗକୁ ଶୀଘ୍ର ଶନାକ୍ତ କରିପାରେ, ଏବଂ ସମୃଦ୍ଧିଶାଳୀ କାଟହୋଇବା ପାଇଁ ବଜାର ରୁଝାନକୁ ପୂର୍ବାନୁମାନ କରିପାରେ।
pa: ਜਾਣੋ ਕਿ ਬੁੱਧੀਮਾਨ ਉਪਕਰਣ ਕਿਵੇਂ ਉਪਜ ਨੂੰ ਅਨੁਕੂਲ ਬਣਾ ਸਕਦੇ ਹਨ, ਬਿਮਾਰੀਆਂ ਨੂੰ ਜਲਦੀ ਪਛਾਣ ਸਕਦੇ ਹਨ, ਅਤੇ ਖੁਸ਼ਹਾਲ ਫਸਲ ਲਈ ਬਜ਼ਾਰ ਰੁਝਾਨਾਂ ਦੀ ਭਵਿੱਖਬਾਣੀ ਕਰ ਸਕਦੇ ਹਨ।

source: Current Weather Conditions
hi: वर्तमान मौसम की स्थिति
or: ବର୍ତ୍ତମାନର ମୌସୁମ ଅବସ୍ଥା
pa: ਮੌਜੂਦਾ ਮੌਸਮ ਹਾਲਾਤ

source: Temperature
hi: तापमान
or: ତାପମାନ
pa: ਤਾਪਮਾਨ

source: Humidity
hi: आर्द्रता
or: ଆର୍ଦ୍ରତା
pa: ਨਮੀ

source: Condition
hi: स्थिति
or: ଅବସ୍ଥା
pa: ਹਾਲਤ

source: Rain Alert!
hi: बारिश अलर्ट!
or: ବର୍ଷା ସତର୍କତା!
pa: ਵਰ੍ਹਾ ਚੇਤਾਵਨੀ!

source: Protect your crops and postpone outdoor activities.
hi: अपनी फसलों की रक्षा करें और बाहरी गतिविधियों को स्थगित करें।
or: ଆପଣଙ୍କର ଫସଲକୁ ସୁରକ୍ଷା କରନ୍ତୁ ଏବଂ ବାହାରମୁଣ୍ଡ କାର୍ଯ୍ୟକଳାପଗୁଡ଼ିକୁ ପଛନ୍ଦା କରନ୍ତୁ।
pa: ਆਪਣੀਆਂ ਫ਼ਸਲਾਂ ਦੀ ਰਾਖੀ ਕਰੋ ਅਤੇ ਬਾਹਰੀ ਗਤੀਵਿਧੀਆਂ ਨੂੰ ਮੁਲਤਵੀ ਕਰੋ।

source: Perfect Weather for Farming!
hi: कृषि के लिए सही मौसम!
or: କୃଷି ପାଇଁ ପରଫେକ୍ଟ୍ ମୌସୁମ!
pa: ਖੇਤੀਬਾੜੀ ਲਈ ਪਰਫੈਕਟ ਮੌਸਮ!

source: Our AI-Powered Features
hi: हमारी एआई-संचालित सुविधाएँ
or: ଆମର AI-ଚାଳିତ ବିଶେଷତ୍ୱ
pa: ਸਾਡੀਆਂ ਏਆਈ-ਸਮਰੱਥ ਵਿਸ਼ੇਸ਼ਤਾਵਾਂ

source: Upload crop images to detect diseases using advanced AI models
hi: उन्नत एआई मॉडल का उपयोग करके फसल छवियों को अपलोड करके रोगों का पता लगाएं
or: ଉନ୍ନତ AI ମଡେଲ୍ଗୁଡ଼ିକର ବ୍ୟବହାର କରି ଫସଲ ଚିତ୍ରଗୁଡ଼ିକୁ ଅପଲୋଡ୍ କରନ୍ତୁ ରୋଗ ଶନାକ୍ତକରଣ କରନ୍ତୁ
pa: ਉੱਨਤ ਏਆਈ ਮਾਡਲਾਂ ਦੀ ਵਰਤੋਂ ਨਾਲ ਫ਼ਸਲ ਤਸਵੀਰਾਂ ਅਪਲੋਡ ਕਰਕੇ ਬਿਮਾਰੀਆਂ ਪਛਾਣੋ

source: Get personalized crop recommendations based on soil and climate data
hi: मिट्टी और जलवायु डेटा पर आधारित व्यक्तिगत फसल सिफारिशें प्राप्त करें
or: ମାଟି ଏବଂ ଜଳବାୟୁ ତଥ୍ୟ ଉପରେ ଆଧାରିତ ବ୍ୟକ୍ତିଗତ ଫସଲ ସୁପାରିଶ ପାଆନ୍ତୁ
pa: ਮਿੱਟੀ ਅਤੇ ਜਲਵਾਯੂ ਡਾਟੇ 'ਤੇ ਅਧਾਰਤ ਨਿੱਜੀ ਫ਼ਸਲ ਸਿਫ਼ਾਰਸ਼ਾਂ ਪ੍ਰਾਪਤ ਕਰੋ

source: Predict crop yields to plan your farming strategy effectively
hi: अपनी कृषि रणनीति को प्रभावी ढंग से योजना बनाने के लिए फसल उपज की भविष्यवाणी करें
or: ଆପଣଙ୍କର କୃଷି ରଣନୀତିକୁ ପ୍ରଭାବଶାଳୀ ଭାବେ ଯୋଜନାବଦ୍ଧ କରିବା ପାଇଁ ଫସଲ ଉତ୍ପାଦନ ପୂର୍ବାନୁମାନ କରନ୍ତୁ
pa: ਆਪਣੀ ਖੇਤੀਬਾੜੀ ਰਣਨੀਤੀ ਨੂੰ ਪ੍ਰਭਾਵੀ ਢੰਗ ਨਾਲ ਯੋਜਨਾਬੱਧ ਕਰਨ ਲਈ ਫ਼ਸਲ ਉਪਜ ਦੀ ਭਵਿੱਖਬਾਣੀ ਕਰੋ

source: Get market price insights for better selling decisions
hi: बेहतर बिक्री निर्णयों के लिए बाजार मूल्य अंतर्दृष्टि प्राप्त करें
or: ଭଲ ବିକ୍ରୟ ନିଷ୍ପତ୍ତି ପାଇଁ ବଜାର ମୂଲ୍ୟ ଆନ୍ତର୍ଦୃଷ୍ଟି ପାଆନ୍ତୁ
pa: ਬਿਹਤਰ ਵਿਕਰੀ ਫ਼ੈਸਲਿਆਂ ਲਈ ਬਜ਼ਾਰ ਕੀਮਤ ਗਿਆਨ ਪ੍ਰਾਪਤ ਕਰੋ

source: Monitor crop health and get pesticide usage recommendations
hi: फसल स्वास्थ्य की निगरानी करें और कीटनाशक उपयोग सिफारिशें प्राप्त करें
or: ଫସଲ ସ୍ୱାସ୍ଥ୍ୟ ନିଗରାଣୀ କରନ୍ତୁ ଏବଂ କୀଟନାଶକ ବ୍ୟବହାର ସୁପାରିଶ ପାଆନ୍ତୁ
pa: ਫ਼ਸਲ ਸਿਹਤ ਦੀ ਨਿਗਰਾਨੀ ਕਰੋ ਅਤੇ ਕੀਟਨਾਸ਼ਕ ਵਰਤੋਂ ਸਿਫ਼ਾਰਸ਼ਾਂ ਪ੍ਰਾਪਤ ਕਰੋ

source: View your prediction history and generate reports
hi: अपने भविष्यवाणी इतिहास को देखें और रिपोर्ट उत्पन्न करें
or: ଆପଣଙ୍କର ପୂର୍ବାନୁମାନ ଇତିହାସ ଦେଖନ୍ତୁ ଏବଂ ରିପୋର୍ଟ ଉତ୍ପାଦନ କରନ୍ତୁ
pa: ਆਪਣੇ ਭਵਿੱਖਬਾਣੀ ਇਤਿਹਾਸ ਨੂੰ ਵੇਖੋ ਅਤੇ ਰਿਪੋਰਟਾਂ ਜਨਰੇਟ ਕਰੋ

source: Try Now
hi: अभी आजमाएं
or: ବର୍ତ୍ତମାନ ଚୟନ କରନ୍ତୁ
pa: ਹੁਣ ਅਜ਼ਮਾਓ

source: View Dashboard
hi: डैशबोर्ड देखें
or: ଡ୍ୟାଶବର୍ଡ ଦେଖନ୍ତୁ
pa: ਡੈਸ਼ਬੋਰਡ ਵੇਖੋ

source: Crop Disease Detection
hi: फसल रोग पहचान
or: ଫସଲ ରୋଗ ଶନାକ୍ତକରଣ
pa: ਫ਼ਸਲ ਬਿਮਾਰੀ ਪਛਾਣ

source: In recent times, drastic climate changes and lack of immunity in crops has caused substantial increase in growth of crop diseases. This causes large scale demolition of crops, decreases cultivation and eventually leads to financial loss of farmers. Due to rapid growth in variety of diseases, identification and treatment of the disease is of major importance.
hi: हाल के समय में, जलवायु परिवर्तन और फसलों में प्रतिरक्षा की कमी ने फसल रोगों के विकास में पर्याप्त वृद्धि का कारण बना है। यह फसलों के बड़े पैमाने पर विध्वंस का कारण बनता है, खेती को कम करता है और अंततः किसानों को वित्तीय हानि का कारण बनता है। रोगों की विविधता में तेजी से वृद्धि के कारण, रोग की पहचान और उपचार महत्वपूर्ण है।
or: ସାଧାରଣ ସମୟରେ, ଜଳବାୟୁ ପରିବର୍ତ୍ତନ ଏବଂ ଫସଲରେ ରୋଗ ପ୍ରତିରୋଧ କ୍ଷମତାର ଅଭାବ ଯୋଗୁଁ ଫସଲ ରୋଗର ବୃଦ୍ଧିରେ ବଡ଼ ପରିମାଣରେ ବୃଦ୍ଧି ହୋଇଛି। ଏହା ଫସଲର ବଡ଼ ସ୍କେଲ୍ ଧ୍ୱଂସର କାରଣ ହୁଏ, କୃଷିକୁ ହ୍ରାସ କରେ ଏବଂ ଅନ୍ତିମରେ କିସାନଙ୍କର ଆର୍ଥିକ କ୍ଷତିର କାରଣ ହୁଏ। ରୋଗର ବିବିଧତାରେ ଦ୍ରୁତ ବୃଦ୍ଧି ଯୋଗୁଁ, ରୋଗର ଶନାକ୍ତକରଣ ଏବଂ ଚିକିତ୍ସା ଅତ୍ୟନ୍ତ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ।
pa: ਹਾਲ ਹੀ ਵਿੱਚ, ਨਾਟਕੀ ਜਲਵਾਯੂ ਬਦਲਾਅ ਅਤੇ ਫ਼ਸਲਾਂ ਵਿੱਚ ਰੋਗ ਪ੍ਰਤੀਰੋਧਕ ਤਾਕਤ ਦੀ ਘਾਟ ਨੇ ਫ਼ਸਲ ਬਿਮਾਰੀਆਂ ਦੇ ਵਿਕਾਸ ਵਿੱਚ ਭਾਰੀ ਵਾਧਾ ਕੀਤਾ ਹੈ। ਇਹ ਫ਼ਸਲਾਂ ਦੇ ਵਿਆਪਕ ਵਿਨਾਸ ਦਾ ਕਾਰਨ ਬਣਦਾ ਹੈ, ਖੇਤੀ ਨੂੰ ਘਟਾਉਂਦਾ ਹੈ ਅਤੇ ਅੰਤ ਵਿੱਚ ਕਿਸਾਨਾਂ ਨੂੰ ਵਿੱਤੀ ਨੁਕਸਾਨ ਪਹੁੰਚਾਉਂਦਾ ਹੈ। ਬਿਮਾਰੀਆਂ ਦੀ ਵਿਭਿੰਨਤਾ ਵਿੱਚ ਤੇਜ਼ ਵਾਧੇ ਕਾਰਨ, ਬਿਮਾਰੀ ਦੀ ਪਛਾਣ ਅਤੇ ਇਲਾਜ ਮਹੱਤਵਪੂਰਨ ਹੈ।

source: Upload Crop Image
hi: फसल छवि अपलोड करें
or: ଫସଲ ଚିତ୍ର ଅପଲୋଡ୍ କରନ୍ତୁ
pa: ਫ਼ਸਲ ਤਸਵੀਰ ਅਪਲੋਡ ਕਰੋ

source: Detect Disease
hi: रोग का पता लगाएं
or: ରୋଗ ଶନାକ୍ତକରଣ କରନ୍ତୁ
pa: ਬਿਮਾਰੀ ਪਛਾਣੋ

source: Analysis Result
hi: विश्लेषण परिणाम
or: ବିଶ୍ଳେଷଣ ପରିଣାମ
pa: ਵਿਸ਼ਲੇਸ਼ਣ ਨਤੀਜਾ

source: Crop
hi: फसल
or: ଫସଲ
pa: ਫ਼ਸਲ

source: Crop Recommendation System
hi: फसल सिफारिश प्रणाली
or: ଫସଲ ସୁପାରିଶ ପ୍ରଣାଳୀ
pa: ਫ਼ਸਲ ਸਿਫ਼ਾਰਸ਼ ਪ੍ਰਣਾਲੀ

source: Crop recommendation is one of the most important aspects of precision agriculture. Crop recommendations are based on a number of factors. Precision agriculture seeks to define these criteria on a site-by-site basis in order to address crop selection issues.
hi: फसल सिफारिश परिशुद्ध कृषि का एक महत्वपूर्ण पहलू है। फसल सिफारिशें कई कारकों पर आधारित हैं। परिशुद्ध कृषि फसल चयन मुद्दों को संबोधित करने के लिए साइट-दर-साइट आधार पर इन मानदंडों को परिभाषित करने का प्रयास करती है।
or: ଫସଲ ସୁପାରିଶ ପାରିଶୁଦ୍ଧ କୃଷିର ସବୁଠାରୁ ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପହଲି ଅଂଶ ଅଟେ। ଫସଲ ସୁପାରିଶଗୁଡ଼ିକ ଅନେକ କାରଣ ଉପରେ ଆଧାରିତ। ପାରିଶୁଦ୍ଧ କୃଷି ଫସଲ ଚୟନ ସମସ୍ୟାକୁ ସମ୍ବୋଧନ କରିବା ପାଇଁ ସାଇଟ୍-ଦ୍ୱାରା ଏହି ମାନଦଣ୍ଡଗୁଡ଼ିକୁ ସୀମାନ୍ତନ କରିବାକୁ ଚେଷ୍ଟା କରେ।
pa: ਫ਼ਸਲ ਸਿਫ਼ਾਰਸ਼ ਸ਼ੁੱਧ ਖੇਤੀਬਾੜੀ ਦਾ ਇੱਕ ਮਹੱਤਵਪੂਰਨ ਪਹਿਲੂ ਹੈ। ਫ਼ਸਲ ਸਿਫ਼ਾਰਸ਼ਾਂ ਕਈ ਕਾਰਕਾਂ 'ਤੇ ਅਧਾਰਤ ਹਨ। ਸ਼ੁੱਧ ਖੇਤੀਬਾੜੀ ਫ਼ਸਲ ਚੋਣ ਮੁੱਦਿਆਂ ਨੂੰ ਹੱਲ ਕਰਨ ਲਈ ਸਾਈਟ-ਦਰ-ਸਾਈਟ ਆਧਾਰ 'ਤੇ ਇਹਨਾਂ ਮਾਪਦੰਡਾਂ ਨੂੰ ਪਰਿਭਾਸ਼ਿਤ ਕਰਨ ਦੀ ਕੋਸ਼ਿਸ਼ ਕਰਦੀ ਹੈ।

source: Nitrogen (N)
hi: नाइट्रोजन (N)
or: ନାଇଟ୍ରୋଜେନ୍ (N)
pa: ਨਾਈਟ੍ਰੋਜਨ (ਐੱਨ)

source: Phosphorus (P)
hi: फॉस्फोरस (P)
or: ଫସ୍ଫରସ୍ (P)
pa: ਫਾਸਫੋਰਸ (ਪੀ)

source: Potassium (K)
hi: पोटैशियम (K)
or: ପଟାଶ୍ୟମ୍ (K)
pa: ਪੋਟਾਸ਼ੀਅਮ (ਕੇ)

source: Temperature (°C)
hi: तापमान (°C)
or: ତାପମାନ (°C)
pa: ਤਾਪਮਾਨ (°ਸੀ)

source: Humidity (%)
hi: आर्द्रता (%)
or: ଆର୍ଦ୍ରତା (%)
pa: ਨਮੀ (%)

source: pH Level
hi: pH स्तर
or: pH ସ୍ତର
pa: ਪੀਐੱਚ ਪੱਧਰ

source: Rainfall (mm)
hi: वर्षा (मिमी)
or: ବର୍ଷା (ମି.ମି.)
pa: ਵਰਸ਼ਾ (ਮਿਲੀਮੀਟਰ)

source: Get Recommendation
hi: सिफारिश प्राप्त करें
or: ସୁପାରିଶ ପାଆନ୍ତୁ
pa: ਸਿਫ਼ਾਰਸ਼ ਪ੍ਰਾਪਤ ਕਰੋ

source: Recommendation
hi: सिफारिश
or: ସୁପାରିଶ
pa: ਸਿਫ਼ਾਰਸ਼

source: Crop Yield Prediction
hi: फसल उपज पूर्वानुमान
or: ଫସଲ ଉତ୍ପାଦନ ପୂର୍ବାନୁମାନ
pa: ਫ਼ਸਲ ਉਪਜ ਭਵਿੱਖਬਾਣੀ

source: Forecasting or predicting the crop yield well ahead of its harvest time would assist the strategists and farmers for taking suitable measures for selling and storage.
hi: फसल उपज का पूर्वानुमान या भविष्यवाणी उसकी कटाई के समय से पहले करना रणनीतिकारों और किसानों को बिक्री और भंडारण के लिए उपयुक्त उपाय लेने में सहायता करेगा।
or: କାଟିବା ସମୟରୁ ବହୁତ ଆଗରୁ ଫସଲ ଉତ୍ପାଦନର ପୂର୍ବାନୁମାନ କରିବା ରଣନୀତିବିଦ୍ମାନଙ୍କୁ ଏବଂ କିସାନଙ୍କୁ ବିକ୍ରୟ ଏବଂ ସଂରକ୍ଷଣ ପାଇଁ ଉପଯୁକ୍ତ ପଦକ୍ଷେପ ନେବାରେ ସାହାଯ୍ୟ କରିବ।
pa: ਫ਼ਸਲ ਉਪਜ ਨੂੰ ਉਸ ਦੇ ਕਟਾਈ ਸਮੇਂ ਤੋਂ ਬਹੁਤ ਪਹਿਲਾਂ ਭਵਿੱਖਬਾਣੀ ਕਰਨਾ ਰਣਨੀਤੀਕਾਰਾਂ ਅਤੇ ਕਿਸਾਨਾਂ ਨੂੰ ਵਿਕਰੀ ਅਤੇ ਭੰਡਾਰਣ ਲਈ ਢੰਗ ਵਾਲੇ ਉਪਾਅ ਲੈਣ ਵਿੱਚ ਮਦਦ ਕਰੇਗਾ।

source: State
hi: राज्य
or: ରାଜ୍ୟ
pa: ਰਾਜ

source: District
hi: जिला
or: ଜିଲ୍ଲା
pa: ਜ਼ਿਲ੍ਹਾ

source: Crop Year
hi: फसल वर्ष
or: ଫସଲ ବର୍ଷ
pa: ਫ਼ਸਲ ਸਾਲ

source: Season
hi: मौसम
or: ଋତୁ
pa: ਮੌਸਮ

source: Area (sq m)
hi: क्षेत्र (वर्ग मीटर)
or: କ୍ଷେତ୍ର (ବର୍ଗ ମିଟର୍)
pa: क्षेत्र (ਵਰਗ ਮੀਟਰ)

source: Predict Yield
hi: उपज पूर्वानुमान
or: ଉତ୍ପାଦନ ପୂର୍ବାନୁମାନ
pa: ਉਪਜ ਭਵਿੱਖਬਾਣੀ

source: Prediction
hi: पूर्वानुमान
or: ପୂର୍ବାନୁମାନ
pa: ਭਵਿੱਖਬਾਣੀ

source: Crop Price Recommendation
hi: फसल मूल्य सिफारिश
or: ଫସଲ ମୂଲ୍ୟ ସୁପାରିଶ
pa: ਫ਼ਸਲ ਕੀਮਤ ਸਿਫ਼ਾਰਸ਼

source: Crop price forecasting techniques are essential because they enable supply chain planners and government bodies to take appropriate actions by estimating market factors such as demand and supply.
hi: फसल मूल्य पूर्वानुमान तकनीकें आवश्यक हैं क्योंकि वे आपूर्ति श्रृंखला योजनाकारों और सरकारी निकायों को मांग और आपूर्ति जैसे बाजार कारकों का अनुमान लगाकर उचित कार्रवाई करने में सक्षम बनाती हैं।
or: ଫସଲ ମୂଲ୍ୟ ପୂର୍ବାନୁମାନ ତକନିକଗୁଡ଼ିକ ଆବଶ୍ୟକ କାରଣ ସେମାନେ ଆପୁର୍ତ୍ତି ଚେନ୍ ୟୋଜନାକାରୀ ଏବଂ ସରକାରୀ ନିକାୟକୁ ମାଙ୍ଗ ଏବଂ ଆପୁର୍ତ୍ତି ଭଳି ବଜାର କାରଣଗୁଡ଼ିକର ଅନୁମାନ କରି ଉପଯୁକ୍ତ କାର୍ଯ୍ୟ ନେବାକୁ ସକ୍ଷମ କରେ।
pa: ਫ਼ਸਲ ਕੀਮਤ ਭਵਿੱਖਬਾਣੀ ਤਕਨੀਕਾਂ ਜ਼ਰੂਰੀ ਹਨ ਕਿਉਂਕਿ ਉਹ ਸਪਲਾਈ ਚੇਨ ਯੋਜਨਾਕਾਰਾਂ ਅਤੇ ਸਰਕਾਰੀ ਏਜੰਸੀਆਂ ਨੂੰ ਮੰਗ ਅਤੇ ਆਪੂਰਤੀ ਵਰਗੇ ਬਜ਼ਾਰ ਕਾਰਕਾਂ ਦੇ ਅਨੁਮਾਨ ਨਾਲ ਢੰਗ ਵਾਲੀ ਕਾਰਵਾਈ ਕਰਨ ਲਈ ਸक्षਮ ਬਣਾਉਂਦੀਆਂ ਹਨ।

source: Market
hi: बाजार
or: ବଜାର
pa: ਬਜ਼ਾਰ

source: Commodity
hi: वस्तु
or: ପନ୍ୟ
pa: ਵਸਤੂ

source: Variety
hi: प्रकार
or: ବିବିଧତା
pa: ਕਿਸਮ

source: Get Price Prediction
hi: मूल्य पूर्वानुमान प्राप्त करें
or: ମୂଲ୍ୟ ପୂର୍ବାନୁମାନ ପାଆନ୍ତୁ
pa: ਕੀਮਤ ਭਵਿੱਖਬਾਣੀ ਪ੍ਰਾਪਤ ਕਰੋ

source: Crop Health Analysis
hi: फसल स्वास्थ्य विश्लेषण
or: ଫସଲ ସ୍ୱାସ୍ଥ୍ୟ ବିଶ୍ଳେଷଣ
pa: ਫ਼ਸਲ ਸਿਹਤ ਵਿਸ਼ਲੇਸ਼ਣ

source: A good harvest is ensured by several factors such as availability of water, soil fertility, protecting crops from rodents, timely use of pesticides & other useful chemicals and nature. While a lot of these factors are difficult to control for, the amount and frequency of pesticides is something the farmer can control.
hi: एक अच्छी फसल कई कारकों द्वारा सुनिश्चित की जाती है जैसे पानी की उपलब्धता, मिट्टी की उर्वरता, फसलों को चूहों से बचाना, कीटनाशकों और अन्य उपयोगी रसायनों का समय पर उपयोग और प्रकृति। जबकि इन कारकों में से बहुत से को नियंत्रित करना कठिन है, कीटनाशकों की मात्रा और आवृत्ति किसान नियंत्रित कर सकता है।
or: ଭଲ କାଟିବା ପାଣିର ଉପଲବ୍ଧତା, ମାଟିର ଉର୍ବରତା, ଫସଲକୁ ଝାଡ଼ଠୁଙ୍କରୁ ସୁରକ୍ଷା, ସମୟସୂଚି ଅନୁଯାୟୀ କୀଟନାଶକ ଏବଂ ଅନ୍ୟ ଉପଯୋଗୀ ରସାୟନ ଏବଂ ପ୍ରକୃତି ଭଳି କିଛି କାରଣ ଦ୍ୱାରା ସୁନିଶ୍ଚିତ ହୁଏ। ଯଦିଓ ଏହି କାରଣଗୁଡ଼ିକରୁ ଅନେକଙ୍କୁ ନିୟନ୍ତ୍ରଣ କରିବା କଠିନ, କୀଟନାଶକର ପରିମାଣ ଏବଂ ଆବୃତ୍ତି ଏକ ବିଷୟ ଯାହା କିସାନ ନିୟନ୍ତ୍ରଣ କରିପାରେ।
pa: ਇੱਕ ਵਧੀਆ ਫ਼ਸਲ ਨੂੰ ਪਾਣੀ ਦੀ ਉਪਲਬਧਤਾ, ਮਿੱਟੀ ਦੀ ਉਰਵਰਤਾ, ਚੂਹਿਆਂ ਤੋਂ ਫ਼ਸਲਾਂ ਦੀ ਰਾਖੀ, ਸਮੇਂ ਸਿਰ ਕੀਟਨਾਸ਼ਕਾਂ ਅਤੇ ਹੋਰ ਉਪਯੋਗੀ ਰਸਾਇਣਾਂ ਦੀ ਵਰਤੋਂ ਅਤੇ ਕੁਦਰਤ ਵਰਗੇ ਕਈ ਕਾਰਕਾਂ ਦੁਆਰਾ ਯਕੀਨੀ ਬਣਾਇਆ ਜਾਂਦਾ ਹੈ। ਜਦੋਂ ਕਿ ਇਹਨਾਂ ਕਾਰਕਾਂ ਵਿੱਚੋਂ ਬਹੁਤ ਸਾਰੇ ਨੂੰ ਕੰਟਰੋਲ ਕਰਨਾ ਮੁਸ਼ਕਲ ਹੈ, ਕੀਟਨਾਸ਼ਕਾਂ ਦੀ ਮਾਤਰਾ ਅਤੇ ਆਵ੍ਰਿਤੀ ਕਿਸਾਨ ਨੂੰ ਕੰਟਰੋਲ ਕਰ ਸਕਦਾ ਹੈ।

source: Estimated Insects Count per sq m
hi: प्रति वर्ग मीटर अनुमानित कीट संख्या
or: ପ୍ରତି ବର୍ଗ ମିଟର୍ରେ ଅନୁମାନିତ କୀଟ ସଂଖ୍ୟା
pa: ਪ੍ਰਤੀ ਵਰਗ ਮੀਟਰ ਅੰਦਾਜ਼ਨ ਕੀੜੇ ਗਿਣਤੀ

source: Crop Type
hi: फसल प्रकार
or: ଫସଲ ପ୍ରକାର
pa: ਫ਼ਸਲ ਕਿਸਮ

source: Soil Type
hi: मिट्टी प्रकार
or: ମାଟି ପ୍ରକାର
pa: ਮਿੱਟੀ ਦੀ ਕਿਸਮ

source: Pesticide Use Category
hi: कीटनाशक उपयोग श्रेणी
or: କୀଟନାଶକ ବ୍ୟବହାର ଶ୍ରେଣୀ
pa: ਕੀਟਨਾਸ਼ਕ ਵਰਤੋਂ ਸ਼੍ਰੇਣੀ

source: Number Doses per Week
hi: प्रति सप्ताह खुराक की संख्या
or: ପ୍ରତି ସପ୍ତାହରେ ଡୋଜ୍ ସଂଖ୍ୟା
pa: ਹਫ਼ਤੇ ਵਿੱਚ ਖੁਰਾਕਾਂ ਦੀ ਗਿਣਤੀ

source: Number of Weeks Used
hi: उपयोग किए गए सप्ताहों की संख्या
or: ବ୍ୟବହୃତ ସପ୍ତାହର ସଂଖ୍ୟା
pa: ਵਰਤੇ ਗਏ ਹਫ਼ਤਿਆਂ ਦੀ ਗਿਣਤੀ

source: Number of Weeks Quit
hi: छोड़े गए सप्ताहों की संख्या
or: ଛାଡ଼ିଥିବା ସପ୍ତାହର ସଂଖ୍ୟା
pa: ਛੱਡੇ ਹੋਏ ਹਫ਼ਤਿਆਂ ਦੀ ਗਿਣਤੀ

source: Predict Health
hi: स्वास्थ्य पूर्वानुमान
or: ସ୍ୱାସ୍ଥ୍ୟ ପୂର୍ବାନୁମାନ
pa: ਸਿਹਤ ਭਵਿੱਖਬਾਣੀ

source: Health Status
hi: स्वास्थ्य स्थिति
or: ସ୍ୱାସ୍ଥ୍ୟ ଅବସ୍ଥା
pa: ਸਿਹਤ ਹਾਲਤ

source: Welcome, %s!
hi: %s का स्वागत है!
or: %sଙ୍କୁ ସ୍ୱାଗତ!
pa: %s ਦਾ ਸਵਾਗਤ ਹੈ!

source: Your AI Farming Journey
hi: आपकी एआई कृषि यात्रा
or: ଆପଣଙ୍କର AI କୃଷି ଯାତ୍ରା
pa: ਤੁਹਾਡੀ ਏਆਈ ਖੇਤੀ ਜ਼ਾਂਚ

source: Download Report (PDF)
hi: रिपोर्ट डाउनलोड करें (पीडीएफ)
or: ରିପୋର୍ଟ୍ ଡାଉନଲୋଡ୍ କରନ୍ତୁ (PDF)
pa: ਰਿਪੋਰਟ ਡਾਊਨਲੋਡ ਕਰੋ (ਪੀਡੀਐੱਫ)

source: Export CSV
hi: CSV निर्यात
or: CSV ନିର୍ଯ୍ୟାସ
pa: ਸੀਐੱਸਵੀ ਨਿਰਯਾਤ

source: Type
hi: प्रकार
or: ପ୍ରକାର
pa: ਕਿਸਮ

source: Inputs
hi: इनपुट
or: ଇନ୍ପୁଟ୍
pa: ਸਿਪਾਰਸ਼

source: Output
hi: आउटपुट
or: ଆଉଟପୁଟ୍
pa: ਆਊਟਪੁਟ

source: Timestamp
hi: समय-चिह्न
or: ସମୟ ଚିହ୍ନ
pa: ਸਮਾਂ-ਚਿਹਨ

source: No predictions yet. Start exploring!
hi: कोई पूर्वानुमान नहीं। अन्वेषण शुरू करें!
or: ଏକାଧିକ ପୂର୍ବାନୁମାନ ନାହିଁ। ଅନ୍ଵେଷଣ ଆରମ୍ଭ କରନ୍ତୁ!
pa: ਹੋਰ ਕੋਈ ਭਵਿੱਖਬਾਣੀ ਨਹੀਂ। ਖੋਜ ਸ਼ੁਰੂ ਕਰੋ!

source: Email
hi: ईमेल
or: ଇମେଲ୍
pa: ਈਮੇਲ

source: Password
hi: पासवर्ड
or: ପାସୱର୍ଡ୍
pa: ਪਾਸਵਰਡ

source: Username
hi: उपयोगकर्ता नाम
or: ଉପଭୋକ୍ତା ନାମ
pa: ਯੂਜ਼ਰਨੇਮ

source: Confirm Password
hi: पासवर्ड की पुष्टि करें
or: ପାସୱର୍ଡ୍ ନିଶ୍ଚିତ କରନ୍ତୁ
pa: ਪਾਸਵਰਡ ਨੂੰ ਪੁਸ਼ਟੀ ਕਰੋ

source: Don't have an account?
hi: खाता नहीं है?
or: ଖାତା ନାହିଁ?
pa: ਖਾਤਾ ਨਹੀਂ ਹੈ?

source: Register here
hi: यहाँ रजिस्टर करें
or: ଏଠାରେ ରେଜିଷ୍ଟର୍ କରନ୍ତୁ
pa: ਇੱਥੇ ਰਜਿਸਟਰ ਕਰੋ

source: Already registered?
hi: पहले से रजिस्टर हैं?
or: ପહିଲେ ରେଜିଷ୍ଟର୍ ହୋଇଛନ୍ତି?
pa: ਪਹਿਲਾਂ ਹੀ ਰਜਿਸਟਰ ਹੋ?

source: Login here
hi: यहाँ लॉगिन करें
or: ଏଠାରେ ଲଗ୍ଇନ୍ କରନ୍ତୁ
pa: ਇੱਥੇ ਲੌਗਇਨ ਕਰੋ

source: Email already registered
hi: ईमेल पहले से रजिस्टर है
or: ଇମେଲ୍ ପહିଲେ ରେଜିଷ୍ଟର୍ ହୋଇଛି
pa: ਈਮੇਲ ਪਹਿਲਾਂ ਹੀ ਰਜਿਸਟਰ ਹੋਈ ਹੈ

source: Registration successful! Please log in.
hi: पंजीकरण सफल! कृपया लॉगिन करें।
or: ରେଜିଷ୍ଟ୍ରେସନ୍ ସଫଳ! ଦୟାକରି ଲଗ୍ଇନ୍ କରନ୍ତୁ।
pa: ਰਜਿਸਟ੍ਰੇਸ਼ਨ ਸਫਲ! ਕਿਰਪਾ ਕਰਕੇ ਲੌਗਇਨ ਕਰੋ।

source: Invalid email or password
hi: अमान्य ईमेल या पासवर्ड
or: ଅବୈଧ ଇମେଲ୍ କିମ୍ବା ପାସୱର୍ଡ୍
pa: ਗਲਤ ਈਮੇਲ ਜਾਂ ਪਾਸਵਰਡ

source: Agri AI Prediction Report
hi: अग्रि एआई पूर्वानुमान रिपोर्ट
or: ଅଗ୍ରି୍ AI ପୂର୍ବାନୁମାନ ରିପୋର୍ଟ୍
pa: ਅਗਰੀ ਏਆਈ ਭਵਿੱਖਬਾਣੀ ਰਿਪੋਰਟ

source: Toggle Weather Theme
hi: मौसम थीम टॉगल करें
or: ମୌସୁମ୍ ଥିମ୍ ଟଗଲ୍ କରନ୍ତୁ
pa: ਮੌਸਮ ਥੀਮ ਟੌਗਲ ਕਰੋ

source: Toggle theme
hi: थीम टॉगल करें
or: ଥିମ୍ ଟଗଲ୍ କରନ୍ତୁ
pa: ਥੀਮ ਟੌਗਲ ਕਰੋ

source: Agri AI - Empowering Smart Agriculture
hi: अग्रि एआई - स्मार्ट कृषि को सशक्त बनाना
or: ଅଗ୍ରି୍ AI - ସ୍ମାର୍ଟ୍ କୃଷିକୁ ସଶକ୍ତ କରୁଛି
pa: ਅਗਰੀ ਏਆਈ - ਸਮਾਰਟ ਖੇਤੀਬਾੜੀ ਨੂੰ ਸਸ਼ਕਤ ਕਰਨਾ

source: Leveraging AI technology to revolutionize farming practices and improve crop yields
hi: कृषि प्रथाओं को क्रांतिकारी बनाने और फसल उपज में सुधार के लिए एआई प्रौद्योगिकी का लाभ उठाना
or: କୃଷି ଅଭ୍ୟାସକୁ କ୍ରାନ୍ତିକାଳୀନ କରିବା ଏବଂ ଫସଲ ଉତ୍ପାଦନରେ ଉନ୍ନତି କରିବା ପାଇଁ AI ପ୍ରଯୁକ୍ତିର ଲାଭ ନେଉଛି
pa: ਖੇਤੀ ਅਭਿਆਸਾਂ ਨੂੰ ਕ੍ਰਾਂਤੀਕਾਰੀ ਬਣਾਉਣ ਅਤੇ ਫ਼ਸਲ ਉਪਜ ਵਿੱਚ ਸੁਧਾਰ ਲਈ ਏਆਈ ਤਕਨਾਲੋਜੀ ਦਾ ਲਾਭ ਲੈਣਾ

source: Agri AI. All rights reserved.
hi: अग्रि एआई। सभी अधिकार सुरक्षित।
or: ଅଗ୍ରି୍ AI। ସମସ୍ତ ଅଧିକାର ସଂରକ୍ଷିତ।
pa: ਅਗਰੀ ਏਆਈ। ਸਾਰੇ ਅਧਿਕਾਰ ਰਾਖਵੇ ਹਨ।

source: Alive
hi: जिंदा
or: ଜୀବନ୍ତ
pa: ਜੀਵੰਤ

source: Possible Damage due to other causes
hi: अन्य कारणों से संभावित क्षति
or: ଅନ୍ୟ କାରଣରୁ ସମ୍ଭାବ କ୍ଷତି
pa: ਹੋਰ ਕਾਰਨਾਂ ਕਾਰਨ ਸੰਭਾਵਿਤ ਨੁਕਸਾਨ

source: Damage due to Pesticides
hi: कीटनाशकों के कारण क्षति
or: କୀଟନାଶକ ଯୋଗୁଁ କ୍ଷତି
pa: ਕੀਟਨਾਸ਼ਕਾਂ ਕਾਰਨ ਨੁਕਸਾਨ

source: Recommended Crop
hi: अनुशंसित फसल
or: ଅନୁସୁଚିତ ଫସଲ
pa: ਸਿਫ਼ਾਰਸ਼ੀ ਫ਼ਸਲ

source: Estimated Yield
hi: अनुमानित उपज
or: ଅନୁମାନିତ ଉତ୍ପାଦନ
pa: ਅੰਦਾਜ਼ਨ ਉਪਜ

source: Suggested Price
hi: सुझाया गया मूल्य
or: ପ୍ରସ୍ତାବିତ ମୂଲ୍ୟ
pa: ਸੁਝਾਇਆ ਕੀਮਤ

source: Shop
hi: दुकान
or: ଦୋକାନ
pa: ਦੁਕਾਨ

source: Post Your Crop
hi: अपनी फसल पोस्ट करें
or: ଆପଣଙ୍କର ଫସଲ ପୋଷ୍ଟ୍ କରନ୍ତୁ
pa: ਆਪਣੀ ਫ਼ਸਲ ਪੋਸਟ ਕਰੋ
